In [1]:
import pandas as pd
import numpy as np

In [112]:
series = pd.Series([5, 6, 7, 8, 9])
series

0    5
1    6
2    7
3    8
4    9
dtype: int64

In [113]:
series.index

RangeIndex(start=0, stop=5, step=1)

In [114]:
series.values

array([5, 6, 7, 8, 9], dtype=int64)

In [115]:
series2 = pd.Series([5, 6, 7, 8, 9], index=['a','b', 'c', 'd', 'e'],
                    dtype=np.float32)
series2

a    5.0
b    6.0
c    7.0
d    8.0
e    9.0
dtype: float32

In [116]:
series2[[4]]

e    9.0
dtype: float32

In [117]:
series2[4]

9.0

In [118]:
series2['a']

5.0

In [119]:
series2[['a']]

a    5.0
dtype: float32

In [120]:
series2[(series2 > 6)] # маска, круглые скобки обязательны для множественых условий

c    7.0
d    8.0
e    9.0
dtype: float32

In [121]:
series3 = pd.Series({'a': 5, 'b': 6, 'c': 7, 'd': 8, 'e': 9})
series3

a    5
b    6
c    7
d    8
e    9
dtype: int64

In [122]:
df = pd.DataFrame({
    'country': ['Kazakhstan', 'Russia', 'Belarus', 'Ukraine'],
    'population': [17.04, 143.5, 9.5, 45.5],
    'square': [2724902, 17125191, 207600, 603628]
})
df

      country  population    square
0  Kazakhstan       17.04   2724902
1      Russia      143.50  17125191
2     Belarus        9.50    207600
3     Ukraine       45.50    603628

In [123]:
df.population

0     17.04
1    143.50
2      9.50
3     45.50
Name: population, dtype: float64

In [124]:
# импорт файлов
# pd.read_csv('filename.csv')
# pd.read_excel('filename.xls')
# pd.read_sql('filename.sql')
# pd.read_table('filename')
# pd.read_json('json_string')
# pd.read_html('url')
# pd.read_clipboard # из буфера обмена
# pd.DataFrame(dict)

# экспорт данных
# df.to_csv('filename.csv')
# df.to_excel('filename.xls')
# df.to_sql('table_name', connection_object)
# df.to_json('filename.json')
# df.to_html('filename.html')
# df.to_clipboard() # в буфер обмена

In [125]:
df.index = ['KZ', 'RU', 'BY', 'UA']
df

       country  population    square
KZ  Kazakhstan       17.04   2724902
RU      Russia      143.50  17125191
BY     Belarus        9.50    207600
UA     Ukraine       45.50    603628

In [126]:
df.loc[['KZ', 'RU'], 'population'] # по строковой метке

KZ     17.04
RU    143.50
Name: population, dtype: float64

In [127]:
df.iloc[[0,1], [1]] # по числовому индексу
#в скобках можно использовать слайсы: df.iloc[:1, 1:5], например

    population
KZ       17.04
RU      143.50

In [128]:
df[df.square > 300000][['country', 'square']] # маска

       country    square
KZ  Kazakhstan   2724902
RU      Russia  17125191
UA     Ukraine    603628

In [129]:
df[df.country == 'Russia'][['country', 'square']]

   country    square
RU  Russia  17125191

In [130]:
df.population > 10

KZ     True
RU     True
BY    False
UA     True
Name: population, dtype: bool

In [131]:
# объявление фильтра
filters = (df.country == 'Russia')
df[filters]

   country  population    square
RU  Russia       143.5  17125191

In [132]:
# быстрая вставка колонки
df['density'] = df['population'] / df['square'] * 1000000
df

       country  population    square  density
KZ  Kazakhstan       17.04   2724902    6.253
RU      Russia      143.50  17125191    8.379
BY     Belarus        9.50    207600   45.761
UA     Ukraine       45.50    603628   75.378

In [133]:
# убираем колонку
df.drop(['density'], axis=1) # исходный df не перезаписывается, если inplace = False

       country  population    square
KZ  Kazakhstan       17.04   2724902
RU      Russia      143.50  17125191
BY     Belarus        9.50    207600
UA     Ukraine       45.50    603628

In [134]:
df.rename(columns={'population': 'country_population'}, inplace=True)
df

       country  country_population    square  density
KZ  Kazakhstan               17.04   2724902    6.253
RU      Russia              143.50  17125191    8.379
BY     Belarus                9.50    207600   45.761
UA     Ukraine               45.50    603628   75.378

In [135]:
df.nlargest(3, 'square') # nsmallest

       country  country_population    square  density
RU      Russia              143.50  17125191    8.379
KZ  Kazakhstan               17.04   2724902    6.253
UA     Ukraine               45.50    603628   75.378

In [136]:
# изменение макс. кол-ва отображаемых столбцов, по умолчанию 20
pd.set_option('display.max_columns', 100)
# изменение макс. кол-ва отображаемых строк, по умолчанию 60
pd.set_option('display.max_rows', 100)
# изменение кол-ва отображаемых знаков после запятой
pd.set_option('display.precision', 3)

In [137]:
meteorite_landings = pd.read_csv('D:\Home tasks\Datasets\meteorite-landings.csv', sep=',')
meteorite_landings.tail() # показать последние n строк, 5 - по умолчанию

,name,id,nametype,recclass,mass,fall,year,reclat,reclong,GeoLocation
45711,Zillah 002,31356,Valid,Eucrite,172.0,Found,1990.0,29.037,17.018,"(29.037000, 17.018500)"
45712,Zinder,30409,Valid,"Pallasite, ungrouped",46.0,Found,1999.0,13.783,8.967,"(13.783330, 8.966670)"
45713,Zlin,30410,Valid,H4,3.3,Found,1939.0,49.250,17.667,"(49.250000, 17.666670)"
45714,Zubkovsky,31357,Valid,L6,2167.0,Found,2003.0,49.789,41.505,"(49.789170, 41.504600)"
45715,Zulu Queen,30414,Valid,L3.7,200.0,Found,1976.0,33.983,-115.683,"(33.983330, -115.683330)"

In [138]:
meteorite_landings.head() # показать первые n строк, 5 - по умолчанию

,name,id,nametype,recclass,mass,fall,year,reclat,reclong,GeoLocation
0,Aachen,1,Valid,L5,21.0,Fell,1880.0,50.775,6.083,"(50.775000, 6.083330)"
1,Aarhus,2,Valid,H6,720.0,Fell,1951.0,56.183,10.233,"(56.183330, 10.233330)"
2,Abee,6,Valid,EH4,107000.0,Fell,1952.0,54.217,-113.000,"(54.216670, -113.000000)"
3,Acapulco,10,Valid,Acapulcoite,1914.0,Fell,1976.0,16.883,-99.900,"(16.883330, -99.900000)"
4,Achiras,370,Valid,L6,780.0,Fell,1902.0,-33.167,-64.950,"(-33.166670, -64.950000)"

In [139]:
chunk_size = 10000

for gm_chunk in pd.read_csv('D:\Home tasks\Datasets\meteorite-landings.csv', sep=',', chunksize=chunk_size):
    print(gm_chunk.shape) # разибивка данных на части (чанки)

(10000, 10)
(10000, 10)
(10000, 10)
(10000, 10)
(5716, 10)

In [140]:
meteorite_landings.shape # размер массива данных, строки х столбцы

(45716, 10)

In [141]:
meteorite_landings.columns

Index(['name', 'id', 'nametype', 'recclass', 'mass', 'fall', 'year', 'reclat',
       'reclong', 'GeoLocation'],
      dtype='object')

In [142]:
meteorite_landings.describe() # числовые статистики

              id       mass       year     reclat    reclong
count  45716.000  4.558e+04  45428.000  38401.000  38401.000
mean   26889.735  1.328e+04   1991.772    -39.123     61.074
std    16860.683  5.750e+05     27.181     46.379     80.647
min        1.000  0.000e+00    301.000    -87.367   -165.433
25%    12688.750  7.200e+00   1987.000    -76.714      0.000
50%    24261.500  3.260e+01   1998.000    -71.500     35.667
75%    40656.750  2.026e+02   2003.000      0.000    157.167
max    57458.000  6.000e+07   2501.000     81.167    354.473

In [143]:
meteorite_landings.describe(include='object')

          name nametype recclass   fall           GeoLocation
count    45716    45716    45716  45716                 38401
unique   45716        2      466      2                 17100
top     Aachen    Valid       L6  Found  (0.000000, 0.000000)
freq         1    45641     8285  44609                  6214

In [144]:
meteorite_landings.recclass.value_counts()[:5]

L6    8285
H5    7142
L5    4796
H6    4528
H4    4211
Name: recclass, dtype: int64

In [145]:
meteorite_landings.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 45716 entries, 0 to 45715
Data columns (total 10 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   name         45716 non-null  object
 1   id           45716 non-null  int64
 2   nametype     45716 non-null  object
 3   recclass     45716 non-null  object
 4   mass         45585 non-null  float64
 5   fall         45716 non-null  object
 6   year         45428 non-null  float64
 7   reclat       38401 non-null  float64
 8   reclong      38401 non-null  float64
 9   GeoLocation  38401 non-null  object
dtypes: float64(4), int64(1), object(5)
memory usage: 3.5+ MB

In [146]:
for dtype in ['float', 'int', 'object']:
    selected_dtype = meteorite_landings.select_dtypes(include=[dtype])
    mean_usage_bytes = selected_dtype.memory_usage(deep = True).mean()
    mean_usage_megabytes = mean_usage_bytes / 1024 ** 2
    print('Average memory usage for {} columns: {:03.2f} MB'.format(dtype, mean_usage_megabytes))

Average memory usage for float columns: 0.28 MB
Average memory usage for int columns: 0.17 MB
Average memory usage for object columns: 2.41 MB

In [147]:
# меняем тип значение колонки mass на float32
meteorite_landings['mass'] = meteorite_landings['mass'].astype(np.float32)
meteorite_landings.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 45716 entries, 0 to 45715
Data columns (total 10 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   name         45716 non-null  object
 1   id           45716 non-null  int64
 2   nametype     45716 non-null  object
 3   recclass     45716 non-null  object
 4   mass         45585 non-null  float32
 5   fall         45716 non-null  object
 6   year         45428 non-null  float64
 7   reclat       38401 non-null  float64
 8   reclong      38401 non-null  float64
 9   GeoLocation  38401 non-null  object
dtypes: float32(1), float64(3), int64(1), object(5)
memory usage: 3.3+ MB

In [148]:
# вывод кол-ва уникальных записей для каждой колонки
[(column, meteorite_landings[column].nunique()) for column in meteorite_landings.columns]

[('name', 45716),
 ('id', 45716),
 ('nametype', 2),
 ('recclass', 466),
 ('mass', 12576),
 ('fall', 2),
 ('year', 268),
 ('reclat', 12738),
 ('reclong', 14640),
 ('GeoLocation', 17100)]

In [149]:
# вывод всех уникальных значений колонки
meteorite_landings.mass.unique()

array([2.100e+01, 7.200e+02, 1.070e+05, ..., 9.000e+05, 1.475e+03,
       2.167e+03], dtype=float32)

In [150]:
meteorite_landings_category = meteorite_landings.copy()
# меняем тип колонки recclass на category
meteorite_landings_category['recclass'] = meteorite_landings['recclass'].astype('category')
meteorite_landings_category.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 45716 entries, 0 to 45715
Data columns (total 10 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   name         45716 non-null  object
 1   id           45716 non-null  int64
 2   nametype     45716 non-null  object
 3   recclass     45716 non-null  category
 4   mass         45585 non-null  float32
 5   fall         45716 non-null  object
 6   year         45428 non-null  float64
 7   reclat       38401 non-null  float64
 8   reclong      38401 non-null  float64
 9   GeoLocation  38401 non-null  object
dtypes: category(1), float32(1), float64(3), int64(1), object(4)
memory usage: 3.1+ MB

In [151]:
# сортировка, по убыванию для recclass + по возрастанию для mass
meteorite_landings.sort_values(by=['recclass', 'mass'], ascending=[True, False]).head()

,name,id,nametype,recclass,mass,fall,year,reclat,reclong,GeoLocation
27673,Northwest Africa 2656,32485,Valid,Acapulcoite,7500.0,Found,2003.0,NaN,NaN,NaN
30353,Northwest Africa 725,17807,Valid,Acapulcoite,3824.0,Found,NaN,30.600,-5.05,"(30.600000, -5.050000)"
27845,Northwest Africa 2871,33345,Valid,Acapulcoite,3467.0,Found,2005.0,NaN,NaN,NaN
7131,Dhofar 125,6910,Valid,Acapulcoite,2697.0,Found,2000.0,18.987,54.60,"(18.986670, 54.600500)"
3,Acapulco,10,Valid,Acapulcoite,1914.0,Fell,1976.0,16.883,-99.90,"(16.883330, -99.900000)"

In [152]:
# применяем функцию np.max для mass и id
meteorite_landings[['mass', 'id']].apply(np.max)

mass    6.000e+07
id      5.746e+04
dtype: float64

In [153]:
# группировка по значениям колонки fall и вывод статистик для колонки mass по сгруппированным значениям
meteorite_landings.groupby(by='fall')['mass'].agg([np.mean, np.max, np.min, np.std])
#meteorite_landings.groupby('fall').aggregate({'mass' : 'mean'})

            mean       amax  amin         std
fall
Fell   47070.715  2.300e+07   0.1  717067.126
Found  12461.923  6.000e+07   0.0  571105.752

In [154]:
# sql - like операции для таблиц
# https://pandas.pydata.org/pandas-docs/stable/user_guide/merging.html

In [155]:
# вывод типов данных, содержащихся в каждой колонке
meteorite_landings.dtypes

name            object
id               int64
nametype        object
recclass        object
mass           float32
fall            object
year           float64
reclat         float64
reclong        float64
GeoLocation     object
dtype: object

In [156]:
#ФИЛЬТРАЦИЯ

In [157]:
# выводим только те строки, в которых значение колонки fall равняется 'Fell'
meteorite_landings.loc[meteorite_landings.fall == 'Fell']
#meteorite_landings.loc[meteorite_landings['fall'] == 'Fell']

,name,id,nametype,recclass,mass,fall,year,reclat,reclong,GeoLocation
0,Aachen,1,Valid,L5,21.0,Fell,1880.0,50.775,6.083,"(50.775000, 6.083330)"
1,Aarhus,2,Valid,H6,720.0,Fell,1951.0,56.183,10.233,"(56.183330, 10.233330)"
2,Abee,6,Valid,EH4,107000.0,Fell,1952.0,54.217,-113.000,"(54.216670, -113.000000)"
3,Acapulco,10,Valid,Acapulcoite,1914.0,Fell,1976.0,16.883,-99.900,"(16.883330, -99.900000)"
4,Achiras,370,Valid,L6,780.0,Fell,1902.0,-33.167,-64.950,"(-33.166670, -64.950000)"
...,...,...,...,...,...,...,...,...,...,...
1103,Zhuanghe,30408,Valid,H5,2900.0,Fell,1976.0,39.667,122.983,"(39.666670, 122.983330)"
1104,Zmenj,30411,Valid,Howardite,246.0,Fell,1858.0,51.833,26.833,"(51.833330, 26.833330)"
1105,Zomba,30412,Valid,L6,7500.0,Fell,1899.0,-15.183,35.283,"(-15.183330, 35.283330)"
1106,Zsadany,30413,Valid,H5,552.0,Fell,1875.0,46.933,21.500,"(46.933330, 21.500000)"
1107,Zvonkov,30415,Valid,H6,2568.0,Fell,1955.0,50.200,30.250,"(50.200000, 30.250000)"

In [158]:
# выводим только те строки, в которых значение mass выше среднего
mean_mass = meteorite_landings['mass'].mean()
meteorite_landings.loc[meteorite_landings['mass'] > mean_mass]

,name,id,nametype,recclass,mass,fall,year,reclat,reclong,GeoLocation
2,Abee,6,Valid,EH4,1.070e+05,Fell,1952.0,54.217,-113.000,"(54.216670, -113.000000)"
7,Agen,392,Valid,H5,3.000e+04,Fell,1814.0,44.217,0.617,"(44.216670, 0.616670)"
11,Aïr,424,Valid,L6,2.400e+04,Fell,1925.0,19.083,8.383,"(19.083330, 8.383330)"
16,Akyumak,433,Valid,"Iron, IVA",5.000e+04,Fell,1981.0,39.917,42.817,"(39.916670, 42.816670)"
27,Alfianello,466,Valid,L6,2.280e+05,Fell,1883.0,45.267,10.150,"(45.266670, 10.150000)"
...,...,...,...,...,...,...,...,...,...,...
45705,Zerhamra,30403,Valid,"Iron, IIIAB-an",6.300e+05,Found,1967.0,29.859,-2.645,"(29.858610, -2.645000)"
45706,Zerkaly,31354,Valid,H5,1.600e+04,Found,1956.0,52.133,81.967,"(52.133330, 81.966670)"
45707,Zhaoping,54609,Valid,"Iron, IAB complex",2.000e+06,Found,1983.0,24.233,111.183,"(24.233330, 111.183330)"
45708,Zhigansk,30405,Valid,"Iron, IIIAB",9.000e+05,Found,1966.0,68.000,128.300,"(68.000000, 128.300000)"
45709,Zhongxiang,30406,Valid,Iron,1.000e+05,Found,1981.0,31.200,112.500,"(31.200000, 112.500000)"

In [159]:
# объединение 2-х предыдущих условий
meteorite_landings.loc[(meteorite_landings['fall'] == 'Fell') & (meteorite_landings['mass'] > mean_mass)]

,name,id,nametype,recclass,mass,fall,year,reclat,reclong,GeoLocation
2,Abee,6,Valid,EH4,107000.0,Fell,1952.0,54.217,-113.000,"(54.216670, -113.000000)"
7,Agen,392,Valid,H5,30000.0,Fell,1814.0,44.217,0.617,"(44.216670, 0.616670)"
11,Aïr,424,Valid,L6,24000.0,Fell,1925.0,19.083,8.383,"(19.083330, 8.383330)"
16,Akyumak,433,Valid,"Iron, IVA",50000.0,Fell,1981.0,39.917,42.817,"(39.916670, 42.816670)"
27,Alfianello,466,Valid,L6,228000.0,Fell,1883.0,45.267,10.150,"(45.266670, 10.150000)"
...,...,...,...,...,...,...,...,...,...,...
1096,Zaoyang,30391,Valid,H5,14250.0,Fell,1984.0,32.300,112.750,"(32.300000, 112.750000)"
1098,Zavid,30396,Valid,L6,95000.0,Fell,1897.0,44.400,19.117,"(44.400000, 19.116670)"
1100,Zemaitkiemis,30399,Valid,L6,44100.0,Fell,1933.0,55.300,25.000,"(55.300000, 25.000000)"
1101,Zhaodong,30404,Valid,L4,42000.0,Fell,1984.0,45.817,125.917,"(45.816670, 125.916670)"
1102,Zhovtnevyi,30407,Valid,H6,107000.0,Fell,1938.0,47.583,37.250,"(47.583330, 37.250000)"

In [160]:
students_performance = pd.read_csv('D:\Home tasks\Datasets\StudentsPerformance.csv')

In [161]:
# переименование колонок
students_performance = students_performance\
                                    .rename(columns=
                                            {'parental level of education': 'parental_level_of_education',
                                            'test preparation course': 'test_preparation_course',
                                            'math score': 'math_score',
                                            'reading score': 'reading_score',
                                            'writing score': 'writing_score'})
# students_performance = students_performance.rename(
#     columns={column: column.replace(" ", "_") for column in students_performance.columns}
# )
# students_performance.columns = [x.replace(" ", "_") for x in students_performance.columns]
students_performance

,gender,race/ethnicity,parental_level_of_education,lunch,test_preparation_course,math_score,reading_score,writing_score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75
...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95
996,male,group C,high school,free/reduced,none,62,55,55
997,female,group C,high school,free/reduced,completed,59,71,65
998,female,group D,some college,standard,completed,68,78,77
999,female,group D,some college,free/reduced,none,77,86,86

In [162]:
# query() - запрос на данные, принимает строку в кавычках (можно исп. операнды внутри строки для объединения условий)
# students.performance.query('math_score > 74')
# students_performance.query("gender == 'female'") # двойные кавычки!!!
students_performance.query("gender == 'female' & math_score > 74") # комбинация

,gender,race/ethnicity,parental_level_of_education,lunch,test_preparation_course,math_score,reading_score,writing_score
2,female,group B,master's degree,standard,none,90,95,93
6,female,group B,some college,standard,completed,88,95,92
38,female,group D,associate's degree,free/reduced,completed,75,90,88
56,female,group E,associate's degree,standard,completed,82,85,86
86,female,group C,some college,free/reduced,none,76,83,88
...,...,...,...,...,...,...,...,...
970,female,group D,bachelor's degree,standard,none,89,100,100
979,female,group C,associate's degree,standard,none,91,95,94
983,female,group A,some college,standard,completed,78,87,91
995,female,group E,master's degree,standard,completed,88,99,95
999,female,group D,some college,free/reduced,none,77,86,86

In [163]:
math_score_query = 80
students_performance.query('math_score > @math_score_query') # @ обязательна!!!

,gender,race/ethnicity,parental_level_of_education,lunch,test_preparation_course,math_score,reading_score,writing_score
2,female,group B,master's degree,standard,none,90,95,93
6,female,group B,some college,standard,completed,88,95,92
16,male,group C,high school,standard,none,88,89,86
34,male,group E,some college,standard,none,97,87,82
35,male,group E,associate's degree,standard,completed,81,81,79
...,...,...,...,...,...,...,...,...
979,female,group C,associate's degree,standard,none,91,95,94
981,male,group D,some high school,standard,none,81,78,78
987,male,group E,some high school,standard,completed,81,75,76
990,male,group E,high school,free/reduced,completed,86,81,75
995,female,group E,master's degree,standard,completed,88,99,95

In [164]:
# отбираем колонки с содержанием 'score' в имени (неправославный метод)
score_columns = [i for i in list(students_performance) if 'score' in i]
# list(students_performance) - выведет список колонок
students_performance[score_columns]

     math_score  reading_score  writing_score
0            72             72             74
1            69             90             88
2            90             95             93
3            47             57             44
4            76             78             75
..          ...            ...            ...
995          88             99             95
996          62             55             55
997          59             71             65
998          68             78             77
999          77             86             86

[1000 rows x 3 columns]

In [165]:
# отбираем колонки с содержанием 'score' в имени (православный метод)
students_performance.filter(like='score') # есть параметр axis

     math_score  reading_score  writing_score
0            72             72             74
1            69             90             88
2            90             95             93
3            47             57             44
4            76             78             75
..          ...            ...            ...
995          88             99             95
996          62             55             55
997          59             71             65
998          68             78             77
999          77             86             86

[1000 rows x 3 columns]

In [166]:
#ГРУППИРОВКА

In [167]:
#группировка по полу и вывод средних значений по колонкам
students_performance.groupby('gender').aggregate({'math_score' : 'mean', 'reading_score' : 'mean'})

        math_score  reading_score
gender
female      63.633         72.608
male        68.728         65.473

In [168]:
#делаем gender колонкой и переименовываем остальные колонки
students_performance.groupby('gender', as_index=False) \
    .aggregate({'math_score' : 'mean', 'reading_score' : 'mean'}) \
    .rename(columns = {'math_score' : 'mean_math_score', 'reading_score' : 'mean_reading_score'})

   gender  mean_math_score  mean_reading_score
0  female           63.633              72.608
1    male           68.728              65.473

In [169]:
# добавляем ещё один критерий для группировки
students_performance.groupby(['gender', 'race/ethnicity'], as_index=False) \
    .aggregate({'math_score' : 'mean', 'reading_score' : 'mean'}) \
    .rename(columns = {'math_score' : 'mean_math_score', 'reading_score' : 'mean_reading_score'})

   gender race/ethnicity  mean_math_score  mean_reading_score
0  female        group A           58.528              69.000
1  female        group B           61.404              71.077
2  female        group C           62.033              71.944
3  female        group D           65.248              74.047
4  female        group E           70.812              75.841
5    male        group A           63.736              61.736
6    male        group B           65.930              62.849
7    male        group C           67.612              65.424
8    male        group D           69.414              66.135
9    male        group E           76.746              70.296

In [170]:
# as_index=True (multiple indexes df)
mean_scores = students_performance.groupby(['gender', 'race/ethnicity']) \
    .aggregate({'math_score' : 'mean', 'reading_score' : 'mean'}) \
    .rename(columns = {'math_score' : 'mean_math_score', 'reading_score' : 'mean_reading_score'})
mean_scores

                       mean_math_score  mean_reading_score
gender race/ethnicity
female group A                  58.528              69.000
       group B                  61.404              71.077
       group C                  62.033              71.944
       group D                  65.248              74.047
       group E                  70.812              75.841
male   group A                  63.736              61.736
       group B                  65.930              62.849
       group C                  67.612              65.424
       group D                  69.414              66.135
       group E                  76.746              70.296

In [171]:
# если надо работать с multiple indexes
mean_scores.loc[[('female', 'group A'), ('male', 'group B')]]

                       mean_math_score  mean_reading_score
gender race/ethnicity
female group A                  58.528              69.000
male   group B                  65.930              62.849

In [172]:
mean_scores.index

MultiIndex([('female', 'group A'),
            ('female', 'group B'),
            ('female', 'group C'),
            ('female', 'group D'),
            ('female', 'group E'),
            (  'male', 'group A'),
            (  'male', 'group B'),
            (  'male', 'group C'),
            (  'male', 'group D'),
            (  'male', 'group E')],
           names=['gender', 'race/ethnicity'])

In [173]:
# вывод топ-5 математиков по полу
students_performance.sort_values(['gender', 'math_score'], ascending=False) \
    .groupby('gender').head()

,gender,race/ethnicity,parental_level_of_education,lunch,test_preparation_course,math_score,reading_score,writing_score
149,male,group E,associate's degree,free/reduced,completed,100,100,93
623,male,group A,some college,standard,completed,100,96,86
625,male,group D,some college,standard,completed,100,97,99
916,male,group E,bachelor's degree,standard,completed,100,100,100
306,male,group E,some college,standard,completed,99,87,81
451,female,group E,some college,standard,none,100,92,97
458,female,group E,bachelor's degree,standard,none,100,100,100
962,female,group E,associate's degree,standard,none,100,100,100
114,female,group E,bachelor's degree,standard,completed,99,100,100
263,female,group E,high school,standard,none,99,93,90

In [174]:
# считаем кол-во девочек и мальчиков
students_performance.value_counts('gender').groupby('gender').head()

gender
female    518
male      482
dtype: int64

In [175]:
# также считаем кол-во девочек и мальчиков по типу обедов
students_performance.groupby(['gender', 'lunch']).agg({'lunch' : 'count'})

                     lunch
gender lunch
female free/reduced    189
       standard        329
male   free/reduced    166
       standard        316

In [177]:
#замена оценок math_score ниже 80 на 0
students_performance.loc[students_performance['math_score'] < 80, 'math_score'] = 0
students_performance
# изменяет исходный фрейм!!!

,gender,race/ethnicity,parental_level_of_education,lunch,test_preparation_course,math_score,reading_score,writing_score
0,female,group B,bachelor's degree,standard,none,0,72,74
1,female,group C,some college,standard,completed,0,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,0,57,44
4,male,group C,some college,standard,none,0,78,75
...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95
996,male,group C,high school,free/reduced,none,0,55,55
997,female,group C,high school,free/reduced,completed,0,71,65
998,female,group D,some college,standard,completed,0,78,77
999,female,group D,some college,free/reduced,none,0,86,86

In [3]:
events_data = pd.read_csv('D:\Home tasks\Datasets\event_data_train.csv')
events_data.head(15)

events_data.action.unique()

# to_datetime - переводит данные в формат даты и времени (в данном случае из секунд в дату)
events_data['date'] = pd.to_datetime(events_data['timestamp'], unit='s')
events_data.head()
#pd.get_dummies() - разбивает колонку на 0 и 1 по принадлежности (one-hot coding)

   step_id   timestamp      action  user_id                date
0    32815  1434340848      viewed    17632 2015-06-15 04:00:48
1    32815  1434340848      passed    17632 2015-06-15 04:00:48
2    32815  1434340848  discovered    17632 2015-06-15 04:00:48
3    32811  1434340895  discovered    17632 2015-06-15 04:01:35
4    32811  1434340895      viewed    17632 2015-06-15 04:01:35

In [4]:
# оставляем только дату
events_data['day'] = events_data.date.dt.date
events_data.head()

   step_id   timestamp      action  user_id                date         day
0    32815  1434340848      viewed    17632 2015-06-15 04:00:48  2015-06-15
1    32815  1434340848      passed    17632 2015-06-15 04:00:48  2015-06-15
2    32815  1434340848  discovered    17632 2015-06-15 04:00:48  2015-06-15
3    32811  1434340895  discovered    17632 2015-06-15 04:01:35  2015-06-15
4    32811  1434340895      viewed    17632 2015-06-15 04:01:35  2015-06-15

In [5]:
# мульти - индекс таблица
pt = events_data.pivot_table(index='user_id',
                        columns='action',
                        values='step_id',
                        aggfunc='count',
                        fill_value=0).reset_index()
pt.head()

action  user_id  discovered  passed  started_attempt  viewed
0             1           1       0                0       1
1             2           9       9                2      10
2             3          91      87               30     192
3             5          11      11                4      12
4             7           1       1                0       1

In [ ]:
#rolling
#expanding
#ewm
#resample

In [2]:
titanic = pd.read_csv('C:/Users/nowic/Desktop/Home tasks/Datasets/titanic.csv')
titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [3]:
titanic['Survived'].mean()

0.3838383838383838

In [4]:
# узнаём средние числовые значения для выживших
titanic[titanic['Survived'] == 1].mean()

C:\Users\nowic\AppData\Local\Temp/ipykernel_2032/830683447.py:2: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  titanic[titanic['Survived'] == 1].mean()

PassengerId    444.368421
Survived         1.000000
Pclass           1.950292
Age             28.343690
SibSp            0.473684
Parch            0.464912
Fare            48.395408
dtype: float64

In [5]:
# узнаём среднее значение класса для выживших
titanic[titanic['Survived'] == 1]['Pclass'].mean()

1.9502923976608186

In [6]:
# находим самого старшего выжившего из 3-его класса
titanic[(titanic['Survived'] == 1) & (titanic['Pclass'] == 3)]['Age'].max()

63.0

In [7]:
# замена значений
d = {0: False, 1: True}
titanic['Survived'] = titanic['Survived'].map(d)
# то же самое: titanic = titanic.replace({'Survived': d})
titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,False,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,True,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,True,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,True,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,False,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [8]:
# статистика по кол-ву выживших/умерших по классу пасажиров
pd.crosstab(titanic['Survived'], titanic['Pclass'])

Pclass      1   2    3
Survived
False      80  97  372
True      136  87  119

In [11]:
# узнаём стат. данные об возрасте по полу и выживаемости
titanic.groupby(['Survived', 'Sex'])['Age'].describe()

                 count       mean        std   min    25%   50%    75%   max
Survived Sex
False    female   64.0  25.046875  13.618591  2.00  16.75  24.5  33.25  57.0
         male    360.0  31.618056  14.056019  1.00  21.75  29.0  39.25  74.0
True     female  197.0  28.847716  14.175073  0.75  19.00  28.0  38.00  63.0
         male     93.0  27.276022  16.504803  0.42  18.00  28.0  36.00  80.0